Repository: leodc/ember
Catalog: AIPhoneAgent/Resources/Localizable.xcstrings
Source language: en
Languages: es

source: A call is already in progress.
es: Ya hay una llamada en curso.

source: A little help with the conversation.
es: Una ayuda para dar el primer paso.

source: A new instruction replaces this question. The agent will ask again if information is still missing.
es: Una instrucción nueva sustituye esta consulta. El agente volverá a preguntar si todavía falta información.

source: A real call will be placed. Calling charges may apply.
es: Se realizará una llamada real. Puede tener un coste.

source: A real Telnyx call will be placed. Carrier charges may apply.
es: Se realizará una llamada real mediante Telnyx. Pueden aplicarse cargos.

source: Add a phone number, appointment purpose, and language to continue.
es: Añade un número de teléfono, el motivo de la cita y el idioma para continuar.

source: Add a valid phone number
es: Añadir un teléfono válido

source: Add an appointment purpose and agent language to continue.
es: Añade el motivo de la cita y el idioma del agente para continuar.

source: Address
es: Dirección

source: Adjust an existing booking.
es: Modifica una reserva existente.

source: Age in years
es: Edad en años

source: Agent
es: Agente

source: Agent language
es: Idioma del agente

source: AGENT LANGUAGE
es: IDIOMA DEL AGENTE

source: Agent listening
es: El agente está escuchando

source: Agent saying goodbye…
es: El agente se está despidiendo…

source: Agent signal blocks
es: Bloques con señal del agente

source: Agent speaking
es: El agente está hablando

source: Agent thinking
es: El agente está pensando

source: Agent transcript
es: Transcripción del agente

source: App and questions
es: Aplicación y preguntas

source: APPOINTMENT FOR
es: MOTIVO DE LA CITA

source: Ask a question
es: Hacer una pregunta

source: Ask me before agreeing to a time
es: Pregúntame antes de aceptar una hora

source: Audio and appointment details are sent to OpenAI. API usage is billed separately.
es: El audio y los datos de la cita se envían a OpenAI. El uso de la API se cobra por separado.

source: Audio bridge · Step 1
es: Puente de audio · Paso 1

source: Audio callback errors
es: Errores de audio

source: Audio diagnostics
es: Diagnóstico de audio

source: Audio queue overflows
es: Desbordamientos de audio

source: Audio supplied to OpenAI
es: Audio enviado a OpenAI

source: Audio supplied to Telnyx
es: Audio enviado a Telnyx

# Audio was interrupted or its route changed. Start a new voice test.
source: The audio was interrupted or its output changed. Start a new rehearsal.
es: El audio se interrumpió o cambió su salida. Inicia otro ensayo.

source: Availability
es: Disponibilidad

source: Available day
es: Día disponible

source: Back to details
es: Volver a los datos

source: Back to home
es: Volver al inicio

source: Back to question
es: Volver a la pregunta

source: Back to setup
es: Volver a configurar

source: Booking name
es: Nombre para la reserva

source: Call a real number and speak yourself. The AI voice is not connected to phone calls yet.
es: Llama a un número real y habla tú. La voz de la IA aún no participa en las llamadas.

source: Call a real number yourself, or try a call where Ember speaks for you.
es: Llama tú a un número real o prueba una llamada en la que Ember habla por ti.

source: Call and test audio
es: Llamar y probar audio

source: Call details
es: Detalles de la llamada

source: CALL FINISHED
es: LLAMADA FINALIZADA

source: Call this number
es: Llamar a este número

source: Call with Ember
es: Llamar con Ember

source: Call your test partner. Send a short tone, then enable voice return so they can hear their own voice with a delay.
es: Llama a la persona que te ayuda con la prueba. Envía un tono breve y después activa el retorno para que escuche su propia voz con un pequeño retraso.

source: Calling your test partner…
es: Llamando a tu contacto de prueba…

source: Cancel
es: Cancelar

source: Change a reservation
es: Cambiar una reserva

source: Check on a request or delivery.
es: Consulta el estado de una solicitud o entrega.

source: Check the details, then choose how to try them.
es: Revisa los datos y elige cómo probarlos.

source: Choose a date and time
es: Elegir fecha y horario

source: Choose an answer
es: Elige una respuesta

source: Choose date and time
es: Elegir fecha y hora

source: Clear
es: Borrar

source: Close
es: Cerrar

source: Coming soon
es: Próximamente

source: Configure %@ in Config.local.xcconfig.
es: Configura %@ en Config.local.xcconfig.

source: Configure OPENAI_API_KEY in Config.local.xcconfig and rebuild the app.
es: Configura OPENAI_API_KEY en Config.local.xcconfig y vuelve a compilar la app.

source: Connected
es: Conectada

source: Connecting
es: Conectando

source: Connecting to OpenAI…
es: Conectando con OpenAI…

source: Continue preparing
es: Continuar preparación

source: Conversation transcript
es: Transcripción de la conversación

source: Couldn’t connect
es: No se pudo conectar

source: Current availability
es: Disponibilidad actual

source: Date
es: Fecha

source: Delayed audio ticks
es: Ciclos de audio con retraso

source: Does everything look right?
es: ¿Todo está correcto?

source: Done
es: Listo

source: e.g. +81 70 1234 5678
es: Ej. +81 70 1234 5678

source: e.g. A dental cleaning
es: p. ej., una limpieza dental

source: e.g. Choose a time within my availability. Ask me about any extra costs.
es: p. ej., elige una hora dentro de mi disponibilidad y pregúntame por cualquier coste adicional.

source: e.g. Japanese
es: p. ej., japonés

source: e.g. Wednesday morning, or Friday after 14:00
es: Ej. Miércoles por la mañana o viernes después de las 14:00

source: Each block is 10 ms. Moving counters alone do not prove that your partner can hear the audio.
es: Cada bloque dura 10 ms. Que los contadores avancen no demuestra por sí solo que la otra persona escuche el audio.

source: Edit
es: Editar

source: Ember speaks with the person who answers. You can reply to questions on screen or send instructions.
es: Ember conversa con la persona que contesta. Puedes responder preguntas en pantalla o enviar instrucciones.

source: Ember waits for the person who answers to say hello.
es: Ember espera a que la persona que contesta salude.

source: Ember will ask when a name is needed.
es: Ember te preguntará si necesita un nombre.

source: Ember will call this number and speak for you. Your iPhone microphone and speaker are not used. Keep the app in the foreground.
es: Ember llamará a este número y hablará por ti. No se usan el micrófono ni el altavoz del iPhone. Mantén la app en primer plano.

source: Ember will use this language for its screens and for questions it asks you. The phone conversation language is configured separately for each call.
es: Ember usará este idioma en sus pantallas y en las preguntas que te haga. El idioma de la conversación telefónica se configura por separado para cada llamada.

source: Enable voice return
es: Activar retorno de voz

source: End call
es: Finalizar llamada

source: End phone call
es: Terminar llamada

source: End rehearsal
es: Terminar ensayo

source: End test call
es: Terminar llamada de prueba

# End voice test
source: End rehearsal
es: Finalizar ensayo

source: Ended
es: Finalizada

source: Ending
es: Finalizando

source: Ending the call does not confirm an appointment. Check the outcome with the recipient.
es: El fin de la llamada no confirma una cita. Comprueba lo acordado con la otra persona.

source: English
es: Inglés

source: Enter a complete phone number, for example 070 1234 5678 or +81 70 1234 5678.
es: Introduce un número completo, por ejemplo 070 1234 5678 o +81 70 1234 5678.

source: Execute call
es: Realizar llamada

source: Experimental audio bridge. A real call is placed only when you start it on the next screen.
es: Puente de audio experimental. La llamada real comienza cuando la inicias en la siguiente pantalla.

source: Failed
es: Error

source: Family name
es: Apellidos

source: Find a time that works for you.
es: Encuentra una hora que te convenga.

source: Follow my availability and ask about anything unknown.
es: Respetar mi disponibilidad y consultar lo que falte.

source: Follow up
es: Dar seguimiento

source: For example: ask about the price
es: Por ejemplo: pregunta por el precio

source: From
es: Desde

source: Get information from a business.
es: Obtén información de un negocio.

source: Give a new instruction
es: Dar una nueva instrucción

source: Give an instruction…
es: Dale una instrucción…

source: Given name
es: Nombre

source: Guide the conversation
es: Guía la conversación

source: How Ember introduces you
es: Cómo te presenta Ember

source: I’ll help you make the call.
es: Te ayudaré a hacer la llamada.

source: If a question needs your input, I’ll ask you here.
es: Si necesito que respondas algo, te preguntaré aquí.

source: If I don’t know something, I’ll ask you here.
es: Si no sé algo, te lo preguntaré aquí.

source: Instruction for the agent
es: Instrucción para el agente

source: Instruction for the agent…
es: Instrucción para el agente…

source: Interrupt and send
es: Interrumpir y enviar

source: Interrupts the agent immediately
es: Interrumpe al agente de inmediato

source: Japanese
es: Japonés

source: Keep Ember in the foreground. Say hello to begin; you can interrupt the agent while it speaks.
es: Mantén Ember en primer plano. Saluda para comenzar; puedes interrumpir al agente mientras habla.

source: Languages spoken
es: Idiomas que hablas

source: Latest messages
es: Mensajes recientes

source: Leave blank and Ember will ask before accepting a time.
es: Si lo dejas vacío, Ember te consultará antes de aceptar un horario.

source: Let Ember make the call
es: Deja que Ember haga la llamada

source: Let’s find a time that works for you.
es: Encontremos una hora que te convenga.

source: Let’s prepare your appointment.
es: Preparemos tu cita.

source: LIVE CALL
es: LLAMADA EN CURSO

source: Make a phone call
es: Hacer una llamada

source: Microphone access is required for this test call. Enable it in Settings and try again.
es: Esta llamada de prueba necesita acceso al micrófono. Actívalo en Ajustes e inténtalo de nuevo.

source: Microphone access is required. Enable it in Settings and try again.
es: Se necesita acceso al micrófono. Actívalo en Ajustes e inténtalo de nuevo.

source: Milestone 2 test
es: Prueba del Milestone 2

source: Milestone 3 · Voice rehearsal
es: Milestone 3 · Ensayo de voz

source: Milestone 5: test telephone audio with a tone and voice return.
es: Milestone 5: prueba de audio telefónico con tono y retorno de voz.

source: More details
es: Más datos

source: Name or business
es: Nombre o negocio

source: Nationality
es: Nacionalidad

source: No speech recognized.
es: No se reconoció voz.

source: Not specified
es: No especificado

source: Occupation
es: Ocupación

source: Once connected, you speak directly to the recipient. Keep Ember open. The AI agent does not join this call.
es: Al conectar, hablarás directamente con la otra persona. Mantén Ember abierto. El agente de IA no participa en esta llamada.

source: OpenAI audio received
es: Audio recibido de OpenAI

source: OpenAI could not process the session. Check your model configuration and API quota, then try again.
es: OpenAI no pudo procesar la sesión. Revisa la configuración del modelo y tu cuota de API e inténtalo de nuevo.

source: OpenAI could not start the session (HTTP %lld). Check your API key, model access and API billing.
es: OpenAI no pudo iniciar la sesión (HTTP %lld). Revisa tu clave API, el acceso al modelo y la facturación de la API.

source: Optional. I’ll ask before agreeing if this is blank.
es: Opcional. Si está vacío, te preguntaré antes de aceptar.

source: Original question
es: Pregunta original

source: Other language
es: Otro idioma

source: Other person
es: Interlocutor

source: Phone call · Ember speaks
es: Llamada telefónica · Habla Ember

source: Phone call · You speak
es: Llamada telefónica · Hablas tú

source: Phone call ended
es: Llamada terminada

source: Phone call finished
es: Llamada finalizada

source: Phone call interrupted
es: Llamada interrumpida

source: Phone call with Ember
es: Llamada con Ember

source: Phone number
es: Número de teléfono

source: Phone number · Optional for rehearsal
es: Teléfono · Opcional para ensayar

source: Play the receptionist. Ember speaks, asks for your input, and follows your written instructions.
es: Haz de recepcionista. Ember conversa, te consulta y sigue tus instrucciones escritas.

source: Preferences & permissions
es: Preferencias y permisos

source: PREFERENCES & PERMISSIONS
es: PREFERENCIAS Y PERMISOS

source: Preferred name
es: Nombre preferido

source: Prepare a call with Ember
es: Preparar llamada con Ember

source: Prepare an appointment
es: Preparar una cita

source: Prepare an appointment, try it with Ember, and stay in control of every decision.
es: Prepara una cita, ensaya con Ember y mantén el control de cada decisión.

source: Prepare appointment
es: Preparar cita

source: Preparing
es: Preparando

source: Preparing Ember and calling…
es: Preparando a Ember y llamando…

source: Profile and settings
es: Perfil y ajustes

source: Question for you
es: Pregunta para ti

source: Ready
es: Lista

source: Ready for the audio test
es: Listo para probar el audio

source: Ready for the conversation?
es: ¿Todo listo para conversar?

source: Ready to call
es: Listo para llamar

# Ready to test
source: Ready to rehearse
es: Listo para ensayar

source: Realtime took too long to connect. Check your network and try again.
es: Realtime tardó demasiado en conectarse. Revisa tu conexión a internet e inténtalo de nuevo.

# Realtime voice test
source: Voice rehearsal
es: Ensayo de voz

source: Received blocks
es: Bloques recibidos

source: Received blocks with signal
es: Bloques recibidos con señal

source: Recipient signal blocks
es: Bloques con señal del receptor

source: Rehearsal interrupted
es: Ensayo interrumpido

source: Rehearse the conversation
es: Ensaya la conversación

source: Rehearse with AI
es: Ensayar con IA

source: Rehearse with Ember
es: Ensayar con Ember

source: Remote peak (0–32768)
es: Pico remoto (0–32768)

source: Review appointment
es: Revisar cita

source: Review details
es: Revisar datos

source: Save
es: Guardar

source: Saved on this iPhone and sent to OpenAI when you start a rehearsal. Ember uses these details only when relevant to your goal. Blank fields remain unknown. Update your age when needed.
es: Se guarda en este iPhone y se envía a OpenAI al iniciar un ensayo. Ember utiliza estos datos solo cuando son pertinentes al objetivo. Los campos vacíos se consideran desconocidos. Actualiza tu edad cuando sea necesario.

source: Say hello as the receptionist to begin.
es: Saluda como recepcionista para empezar.

source: Send a 1-second tone
es: Enviar un tono de 1 segundo

source: Send answer
es: Enviar respuesta

source: Sending answer…
es: Enviando respuesta…

source: Sending instruction…
es: Enviando instrucción…

source: Sending…
es: Enviando…

source: Set the goal, your availability, and what Ember can agree to.
es: Define el objetivo, tu disponibilidad y qué puede aceptar Ember.

source: Set up an appointment
es: Programar una cita

source: Set what I can do and what needs your approval.
es: Define qué puedo hacer y qué necesita tu aprobación.

source: Settings
es: Configuración

source: Sex
es: Sexo

source: Spanish
es: Español

source: Speak as the receptionist. The agent uses your appointment details and selected agent language. No phone number is dialed.
es: Habla como la recepcionista. El agente utiliza los datos de tu cita y el idioma elegido para el agente. No se marca ningún número.

source: Start a new rehearsal
es: Iniciar otro ensayo

source: Start rehearsal
es: Iniciar ensayo

# Start voice test
source: Start rehearsal
es: Iniciar ensayo

source: Start with what you need. You can rehearse with Ember before making a real phone call.
es: Cuéntale a Ember lo que necesitas. Puedes ensayar antes de hacer una llamada real.

source: Stop voice return
es: Detener retorno de voz

source: Supplied blocks
es: Bloques enviados a Telnyx

source: Supplied blocks with signal
es: Bloques enviados con señal

source: Tell me what you need. I’ll follow your instructions and check with you when I need an answer.
es: Dime qué necesitas. Seguiré tus instrucciones y te consultaré cuando necesite una respuesta.

source: Tell me what you want to achieve.
es: Dime qué quieres conseguir.

source: Tell me who to call and when you’re free. I’ll follow your preferences and ask if I need anything else.
es: Dime a quién llamar y cuándo estás disponible. Seguiré tus preferencias y preguntaré si necesito algo más.

source: Tell the agent what to do next. It will interrupt its current response.
es: Indica al agente qué hacer a continuación. Interrumpirá su respuesta actual.

source: Telnyx audio received
es: Audio recibido de Telnyx

source: Test call ended
es: Llamada de prueba terminada

source: Test OpenAI voice
es: Probar voz de OpenAI

source: Test the agent with these details before connecting it to a phone call.
es: Prueba al agente con estos datos antes de conectarlo a una llamada telefónica.

source: Test the audio bridge
es: Probar el puente de audio

source: Text may include speech you interrupted.
es: El texto puede incluir frases que interrumpiste.

source: The agent ended the session
es: El agente finalizó la sesión

source: The agent is waiting. Your answer will be used in this conversation.
es: El agente está esperando. Tu respuesta se usará en esta conversación.

source: The audio bridge could not keep up. The call has ended; start a new call.
es: El puente de audio no pudo mantener el ritmo. La llamada terminó; inicia una nueva.

source: The audio callback failed. End this test and try again.
es: Falló el intercambio de audio. Inicia una nueva prueba.

source: The call has ended. A booking is confirmed only if the recipient explicitly confirmed it.
es: La llamada terminó. Una reserva solo está confirmada si la persona que atendió la confirmó expresamente.

source: The call was dropped: %@
es: La llamada se interrumpió: %@

source: The connection to Telnyx was lost.
es: Se perdió la conexión con Telnyx.

source: The conversation will appear here
es: La conversación aparecerá aquí

source: The end time must be after the start time.
es: La hora de finalización debe ser posterior a la hora de inicio.

# The instruction could not be sent in time. Start a new voice test.
source: The instruction could not be sent in time. Start a new rehearsal.
es: No se pudo enviar la instrucción a tiempo. Inicia otro ensayo.

source: The iPhone audio session could not be activated.
es: No se pudo activar el audio del iPhone.

source: The Realtime connection was lost. Check your network and try again.
es: Se perdió la conexión con Realtime. Revisa tu conexión a internet e inténtalo de nuevo.

source: The session closed because the final goodbye could not finish. The booking status has not changed.
es: La sesión se cerró porque no pudo completarse la despedida. El estado de la reserva no ha cambiado.

source: The test call did not connect within 60 seconds.
es: La llamada de prueba no se conectó en 60 segundos.

source: The test call lost its connection. Start a new test.
es: La llamada de prueba perdió la conexión. Inicia una nueva prueba.

source: This call uses your iPhone microphone and its current audio output. Keep Ember open during the test.
es: Esta llamada usa el micrófono y la salida de audio actual del iPhone. Mantén Ember abierta durante la prueba.

source: This calls a real number using your microphone. Ember’s AI voice does not join this call yet.
es: Se llama a un número real con tu micrófono. La voz de Ember aún no participa en esta llamada.

source: This calls a real number using your microphone. You speak directly to the recipient.
es: Llama a un número real usando tu micrófono. Tú hablas directamente con la persona que contesta.

source: This places a real call. Telnyx and OpenAI charges apply. Call audio and appointment details are sent to OpenAI.
es: Se realizará una llamada real. Se aplican costes de Telnyx y OpenAI. El audio de la llamada y los datos de la cita se envían a OpenAI.

source: This test uses no iPhone microphone or speaker. OpenAI is not connected yet.
es: Esta prueba no usa el micrófono ni el altavoz del iPhone. OpenAI todavía no está conectado.

source: This was a rehearsal. No appointment was booked by the app.
es: Esto fue un ensayo. La app no ha reservado ninguna cita.

source: Time window
es: Franja horaria

source: Transcribing…
es: Transcribiendo…

source: Transcription unavailable for this turn.
es: No se pudo transcribir este turno.

source: Transcripts may be delayed or inaccurate and may include interrupted speech.
es: La transcripción puede tardar, contener errores o incluir palabras interrumpidas.

source: Two ways to try Ember
es: Dos formas de probar Ember

source: Until
es: Hasta

source: Use earpiece
es: Usar auricular

source: Use speaker
es: Usar altavoz

source: Use the name you want the recipient to hear. All profile details are optional.
es: Usa el nombre con el que quieres presentarte. Todos los datos del perfil son opcionales.

source: Use the receiver on the other phone to avoid acoustic feedback. Keep this app in the foreground.
es: Usa el auricular del otro teléfono para evitar realimentación acústica. Mantén esta app en primer plano.

source: Use this time
es: Usar este horario

source: Using this time replaces the current availability.
es: Este horario sustituirá la disponibilidad actual.

source: Voice conversation
es: Conversación de voz

source: Voice rehearsal
es: Ensayo de voz

# Voice test ended
source: Rehearsal ended
es: Ensayo finalizado

source: Waiting for user
es: Esperando al usuario

source: Waiting for your answer
es: Esperando tu respuesta

source: What is the appointment for?
es: ¿Cuál es el motivo de la cita?

source: What would you like to do?
es: ¿Qué te gustaría hacer?

source: When are you available?
es: ¿Cuándo estás disponible?

source: Who should I call?
es: ¿A quién debo llamar?

source: Write a different answer
es: Escribir otra respuesta

source: Write response…
es: Escribir respuesta…

source: Write…
es: Escribe…

source: You are speaking directly to the recipient. Keep Ember open. The AI agent is not part of this call.
es: Hablas directamente con la otra persona. Mantén Ember abierto. El agente de IA no participa en esta llamada.

source: You can answer Ember’s questions or send a new instruction at any time.
es: Puedes responder a Ember o darle una nueva instrucción en cualquier momento.

source: You play the receptionist; Ember represents you. Say hello, ask a question, or offer a different time. No real call is made.
es: Tú haces de recepcionista y Ember te representa. Saluda, haz una pregunta u ofrece otro horario. No se realiza una llamada real.

source: You play the receptionist. No phone number is dialed.
es: Tú haces de recepcionista. No se marca ningún teléfono.

source: You’re in control
es: Tú tienes el control

source: You’re making this call
es: Tú realizas esta llamada

source: Your answer
es: Tu respuesta

source: Your answers and instructions stay in your hands.
es: Tú decides qué responder y cómo continuar.

source: Your appointment
es: Tu cita

source: YOUR AVAILABILITY
es: TU DISPONIBILIDAD

source: Your boundaries
es: Tus límites

source: Your call
es: Tu llamada

source: Your calling assistant
es: Tu asistente telefónico

source: Your goal
es: Tu objetivo

source: Your identity
es: Tu identidad

source: Your input
es: Tu intervención

source: Your instruction
es: Tu instrucción

source: Your language
es: Tu idioma

source: Your microphone is live
es: Tu micrófono está activo
